In [181]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sb

In [4]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
football.head()

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5

In [11]:
football.to_excel('Data_while_learning/football.xlsx', index = False)

In [15]:
footy = pd.read_excel('Data_generated_while_learning/football.xlsx')

In [16]:
footy.head()

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5

# Excercise from here:
http://www.gregreda.com/2013/10/26/working-with-pandas-dataframes/

First one is not connected with following tutorials

In [144]:
url = "https://raw.github.com/gjreda/best-sandwiches/master/data/best-sandwiches-geocode.tsv"
dataframe =  pd.read_csv(url, sep = '\t')
dataframe = dataframe.rename(columns = {'rank':'Rank','sandwich':'Sandwich','restaurant':'Restaurant'})
dataframe.head(2)

,Rank,Sandwich,Restaurant,description,price,address,city,phone,website,full_address,formatted_address,lat,lng
0,1,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10,2109 W. Chicago Ave.,Chicago,773-772-0406,theoldoaktap.com,"2109 W. Chicago Ave., Chicago","2109 West Chicago Avenue, Chicago, IL 60622, USA",41.895734,-87.679960
1,2,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9,800 W. Randolph St.,Chicago,312-929-4580,aucheval.tumblr.com,"800 W. Randolph St., Chicago","800 West Randolph Street, Chicago, IL 60607, USA",41.884672,-87.647754

In [145]:
columns = ['Age','Gender','Occupation','ID']
data_user = pd.read_csv('Data_generated_while_learning/ml-100k/u.user', sep = '|', names = columns)
data_user.head()

   Age Gender  Occupation     ID
1   24      M  technician  85711
2   53      F       other  94043
3   23      M      writer  32067
4   24      M  technician  43537
5   33      F       other  15213

In [146]:
data_user.set_index(data_user.index - 1,inplace = True)
data_user.head()

   Age Gender  Occupation     ID
0   24      M  technician  85711
1   53      F       other  94043
2   23      M      writer  32067
3   24      M  technician  43537
4   33      F       other  15213

In [147]:
data_ratings = pd.read_csv('Data_generated_while_learning/ml-100k/u.data', sep = '\t', names = ['user_id','movie_id','user_ratings','unix_timestamp'])
data_ratings.head()

   user_id  movie_id  user_ratings  unix_timestamp
0      196       242             3       881250949
1      186       302             3       891717742
2       22       377             1       878887116
3      244        51             2       880606923
4      166       346             1       886397596

In [148]:
colmns = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
data_movies = pd.read_csv('Data_generated_while_learning/ml-100k/u.item', sep = '|', names = colmns, usecols = range(5), encoding = 'latin-1')
data_movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [149]:
data_movies.drop('video_release_date',axis = 1, inplace = True) 
data_movies.iloc[5:8]

,movie_id,title,release_date,imdb_url
5,6,Shanghai Triad (Yao a yao yao dao waipo qiao) ...,01-Jan-1995,http://us.imdb.com/Title?Yao+a+yao+yao+dao+wai...
6,7,Twelve Monkeys (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Twelve%20Monk...
7,8,Babe (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Babe%20(1995)

In [155]:
data_user[data_user.Age  ==  40].head(3)

    Age Gender Occupation     ID
18   40      M  librarian  02138
26   40      F  librarian  30030
82   40      M      other  44133

In [157]:
a = data_user. set_index('ID')
a.head()

       Age Gender  Occupation
ID
85711   24      M  technician
94043   53      F       other
32067   23      M      writer
43537   24      M  technician
15213   33      F       other

In [202]:
data_user.iloc[2,2]

'writer'

In [215]:
data_user.iloc[3:7,[2,1]]

      Occupation Gender
3     technician      M
4          other      F
5      executive      M
6  administrator      M

In [232]:
x = data_user[(data_user['Age'] >= 30)]
x.head()

   Age Gender     Occupation     ID
1   53      F          other  94043
4   33      F          other  15213
5   42      M      executive  98101
6   57      M  administrator  91344
7   36      M  administrator  05201

In [221]:
x['Occupation'].value_counts()

educator         83
other            63
administrator    60
engineer         44
librarian        40
programmer       36
writer           29
executive        25
scientist        23
marketing        21
student          16
artist           15
technician       15
retired          14
healthcare       12
salesman          9
lawyer            8
entertainment     8
doctor            5
homemaker         4
none              4
Name: Occupation, dtype: int64

In [237]:
dataframe1 = pd.DataFrame({'ID': ['0011','0013','0014','0016','0017'], 
                           'First Name': ['Joseph', 'Mike', 'Jordan', 'Steven', 'Susan']})
dataframe2 = pd.DataFrame({'ID': ['0010','0011','0013','0014','0017'], 
                           'Last Name': ['Gordan', 'Johnson', 'Might' , 'Jackson', 'Shack']})
dataframe3 = pd.DataFrame({'ID': ['0020','0022','0025'],
                           'First Name': ['Adam', 'Jackie', 'Sue']})
dataframe4 = pd.DataFrame({'Key': ['0020','0022','0025'],
                           'Scores': [95, 90, 80]})

In [260]:
pd.concat([dataframe1, dataframe3],sort = True, )

  First Name    ID
0     Joseph  0011
1       Mike  0013
2     Jordan  0014
3     Steven  0016
4      Susan  0017
0       Adam  0020
1     Jackie  0022
2        Sue  0025

In [271]:
pd.merge(dataframe3, dataframe4, left_on = 'ID', right_on = 'Key', how = 'inner', sort = False)

     ID First Name   Key  Scores
0  0020       Adam  0020      95
1  0022     Jackie  0022      90
2  0025        Sue  0025      80

In [272]:
org_df = pd.DataFrame({'ID': ['11', '12', '13', '14'],
                       'NAME': ['Kiara', 'Rajah', 'Simba', np.nan],
                       'TEST 1': [66, 99, 75, 23]})

new_data_df = pd.DataFrame({'ID': ['11', '14', '15'],
                       'NAME': ['Kiara', 'Wilbert', 'Momma'],
                       'TEST 1': [75, np.nan, 23]})

In [281]:
pd.concat([org_df, new_data_df], axis = 1)

   ID   NAME  TEST 1   ID     NAME  TEST 1
0  11  Kiara      66   11    Kiara    75.0
1  12  Rajah      99   14  Wilbert     NaN
2  13  Simba      75   15    Momma    23.0
3  14    NaN      23  NaN      NaN     NaN

In [314]:
combined_df = pd.merge(org_df,new_data_df, on = 'ID', how = 'outer', suffixes = ('_m','_n'), indicator = True)
combined_df

   ID NAME_m  TEST 1_m   NAME_n  TEST 1_n      _merge
0  11  Kiara      66.0    Kiara      75.0        both
1  12  Rajah      99.0      NaN       NaN   left_only
2  13  Simba      75.0      NaN       NaN   left_only
3  14    NaN      23.0  Wilbert       NaN        both
4  15    NaN       NaN    Momma      23.0  right_only

In [315]:
combined_df['NAME'] = combined_df['NAME_m'].where(combined_df['NAME_n'].isnull(), combined_df['NAME_n'])
combined_df

   ID NAME_m  TEST 1_m   NAME_n  TEST 1_n      _merge     NAME
0  11  Kiara      66.0    Kiara      75.0        both    Kiara
1  12  Rajah      99.0      NaN       NaN   left_only    Rajah
2  13  Simba      75.0      NaN       NaN   left_only    Simba
3  14    NaN      23.0  Wilbert       NaN        both  Wilbert
4  15    NaN       NaN    Momma      23.0  right_only    Momma

In [317]:
combined_df.drop(['NAME_m', 'NAME_n', 'TEST 1_m', 'TEST 1_n', '_merge'], axis= 1, inplace= True)
combined_df

   ID     NAME
0  11    Kiara
1  12    Rajah
2  13    Simba
3  14  Wilbert
4  15    Momma